BAS BMEKZU Project/src/Documents/ИНАГРО_Взвешивание/ИНАГРО_Взвешивание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИНАГРО_Взвешивание</name>
  <registerRecords>AccumulationRegister.ИНАГРО_РасчетыПоУслугам</registerRecords>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовщик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесТары1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>String</types>
      <types>CatalogRef.ИНАГРО_Водители</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВыбытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПрибытия</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТранспорта</name>
    <comment>Номер транспорта</comment>
    <type>
      <types>CatalogRef.ИНАГРО_ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеДвиженияФормы36</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьЕдиницаИзмерения</name>
    <comment>Единица измерения</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтражатьВБухгалтерскомУчете</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТолькоЗарегистрировать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТранспорт</name>
    <type>
      <types>CatalogRef.ИНАГРО_ТранспортныеСредства</types>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

BAS BMEKZU Project/src/Documents/ИНАГРО_Взвешивание/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипДанныхЗаполнения = ТипЗнч(ДанныеЗаполнения);	
	
	ИНАГРО_ЭлеваторЗаполнениеДокументов.ЗаполнитьШапкуДокумента(ЭтотОбъект);
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения); 
	
	ВремяПрибытия = ТекущаяДата();
  	ВремяВыбытия  = ТекущаяДата();	
			
	Весовщик      = Пользователи.ТекущийПользователь();
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда		
		
		ВремяНачалаДня = ИНАГРО_Элеватор.ПолучитьПараметрУчетаЭлеватора(Дата, "ВремяНачалаДня", 0);
				
		Дата = Дата + 60 * 60 * ВремяНачалаДня; 

	КонецЕсли;  
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Перем Заголовок, СтруктураШапкиДокумента;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = ОбщегоНазначенияБПВызовСервера.ПредставлениеДокументаПриПроведении(Ссылка);
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегиструРасчетыПоУслугам();		
	КонецЕсли;
	
	ПроведениеСервер.ПодготовитьНаборыЗаписейКЗаписиДвижений(ЭтотОбъект); 	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
	Движения.Записать();
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
	ВесБрутто  = 0;
	ВесБрутто1 = 0;
	ВесТары    = 0;
	ВесТары1   = 0;
	ВесНетто   = 0;
	ВесНетто1  = 0; 	
		
	Вес        = 0;
	
КонецПроцедуры

#КонецОбласти

#Область Проведение

Процедура ДвиженияПоРегиструРасчетыПоУслугам()
	
	ТаблицаУслуг = СформироватьТаблицуУслуг();
	
	Если ТаблицаУслуг.Количество() > 0 Тогда
		ИНАГРО_Элеватор.ДвиженияПоРегиструРасчетыПоУслугам(Движения, ТаблицаУслуг, "Приход");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СформироватьТаблицуУслуг()
	
	ТаблицаУслуг = Новый ТаблицаЗначений;
	ТаблицаУслуг.Колонки.Добавить("ДатаРасчета");
	ТаблицаУслуг.Колонки.Добавить("Ссылка"); 
	ТаблицаУслуг.Колонки.Добавить("Организация");
	ТаблицаУслуг.Колонки.Добавить("Контрагент");
	ТаблицаУслуг.Колонки.Добавить("ДоговорКонтрагента");
	ТаблицаУслуг.Колонки.Добавить("Номенклатура");
	ТаблицаУслуг.Колонки.Добавить("Культура");
	ТаблицаУслуг.Колонки.Добавить("Склад");
	ТаблицаУслуг.Колонки.Добавить("ВидХранения");
	ТаблицаУслуг.Колонки.Добавить("Урожай");
	ТаблицаУслуг.Колонки.Добавить("Количество");
	ТаблицаУслуг.Колонки.Добавить("Стоимость"); 
	
	Культура = ИНАГРО_Элеватор.ПолучитьДополнительныйРеквизитНоменклатуры(Номенклатура, "ВидКультуры").ВидКультурыДляРасчетаСтоимостиУслуги;
	
	ТекущаяЦена = ИНАГРО_Элеватор.ПолучитьЦенуУслугиЭлеватора(Организация, Дата, Владелец, ДоговорКонтрагента, Культура, , ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("Взвешивание"));
	
	Если ТекущаяЦена <> 0 Тогда 													 
		НоваяСтрока = ТаблицаУслуг.Добавить();
		НоваяСтрока.ДатаРасчета        = Дата;
		НоваяСтрока.Ссылка             = Ссылка; 
		НоваяСтрока.Организация        = Организация;
		НоваяСтрока.Контрагент         = Владелец;
		НоваяСтрока.ДоговорКонтрагента = ДоговорКонтрагента;
		НоваяСтрока.Номенклатура       = ИНАГРО_Элеватор.ПолучитьПредопределеннуюНоменклатуру("Взвешивание");
		НоваяСтрока.Культура           = Номенклатура;
		НоваяСтрока.Количество         = 1;
		НоваяСтрока.Стоимость          = НоваяСтрока.Количество * ТекущаяЦена;
	КонецЕсли;
	
	Возврат ТаблицаУслуг;
	
КонецФункции

#КонецОбласти

#КонецЕсли
